# TP2 - Consultas

In [1]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt

## Criando o banco de dados

Para executar os códigos neste notebook, é necessário possuir o banco de dados relacional do IMDB no mesmo diretório desse notebook. Caso você ainda não possua o banco de dados, você deve seguir esses passos:
    1. Instale o imdb-sqlite seguindo as instruções em: https://pypi.org/project/imdb-sqlite/
    2. Rode o imdb-sqlite na mesma pasta desse notebook.
Caso você já possua o banco de dados, basta movê-lo para o mesmo diretório deste notebook.

## Abrindo o banco de dados

In [2]:
 conn = sqlite3.connect('imdb.db')

## Consultas

### Consulta 1

In [5]:
df1 = pd.read_sql_query(
"""
SELECT *
FROM titles
WHERE original_title="O Auto da Compadecida"    
""", conn)

df1

,title_id,type,primary_title,original_title,is_adult,premiered,ended,runtime_minutes,genres
0,tt0197139,tvMiniSeries,O Auto da Compadecida,O Auto da Compadecida,0,1999,1999.0,NaN,"Comedy,Drama,Romance"
1,tt0271383,movie,A Dog's Will,O Auto da Compadecida,0,2000,NaN,104.0,"Adventure,Comedy"

### Consulta 2

In [22]:
df2 = pd.read_sql_query(
"""
SELECT *
FROM akas
WHERE region="BR" and is_original_title=1
""", conn)

df2

,title_id,title,region,language,types,attributes,is_original_title
0,tt7040678,Namoro À Distância,BR,None,original,None,1